tap "acsandmann/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jackielii/tap"
tap "koekeishiya/formulae"
# Run your GitHub Actions locally
brew "act"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line batch renaming tool
brew "f2"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Perfect hash function generator
brew "gperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Small build system for use with gyp or CMake
brew "ninja"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher", restart_service: :changed
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Watch files and take action when they change
brew "watchman"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Tiling window manager for macOS
brew "acsandmann/tap/rift"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# Utility to adjust keyrepeat settings for MacOS.
brew "koekeishiya/formulae/krp"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Japanese input method
cask "azookey"
# Virtual workspace manager
cask "flashspace"
cask "font-hack-nerd-font"
# Notes manager
cask "fsnotes"
# Web browser
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Keyboard customiser
cask "karabiner-elements"
# Customise mouse behavior
cask "linearmouse"
# Used to access context-specific actions when text is selected
cask "popclip"
# Control your tools with a few keystrokes
cask "raycast"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
vscode "anthropic.claude-code"
vscode "bierner.markdown-preview-github-styles"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-repositories"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "yoavbls.pretty-ts-errors"
vscode "znck.vue"
npm "corepack"

# --- 手動追加: Claude Code (brew bundle dump では未捕捉) ---
# Anthropic 公式 CLI / IDE 連携。新PCでアプリと一括導入するため明示。
cask "claude-code"

# --- 既存 ~/.Brewfile から温存（dump 未捕捉。新PC再現のため明示保持）---
brew "trash"
mas "Be Focused Pro", id: 961632517
mas "Dropover", id: 1355679052
mas "EdgeView 2", id: 1206246482
mas "Flashcards", id: 307840670
mas "PopClip", id: 445189367
vscode "bierner.markdown-mermaid"
vscode "clinyong.vscode-css-modules"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "orsenkucher.vscode-graphql"
vscode "ryanluker.vscode-coverage-gutters"
vscode "stylelint.vscode-stylelint"
vscode "yzane.markdown-pdf"
