tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "asdf"
brew "chezmoi"
brew "colima"
brew "docker"
brew "f2"
brew "gh"
brew "ghq"
brew "jq"
brew "mas"
brew "trash"
brew "watchman"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/yabai"
cask "alt-tab"
cask "appcleaner"
cask "font-hack-nerd-font"
cask "fsnotes"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "raycast"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zed"
mas "Be Focused Pro", id: 961632517
mas "Dropover", id: 1355679052
mas "EdgeView 2", id: 1206246482
mas "Flashcards", id: 307840670
mas "PopClip", id: 445189367
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "orsenkucher.vscode-graphql"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "znck.vue"
